{"id": 9995, "resume_key": 9995, "resume_mime": null, "state": " MD", "created_at": null, "parser": "pdfminer", "error": null, "text": "Sebastian Grammas  \nsgrammas10@gmail.com | 410-212-0874  \n\nRelevant Experience  \nSoftware Engineer Intern — ALQIMI Technology Solutions (Rockville, MD) May–Aug 2024, 2025 \n• Delivered production-ready conversational AI features adopted for client-facing use, converting static \ndocuments and images into interactive, searchable insights.  \n• Designed and shipped ALQIMI Assistant, a document-centric chat platform enabling natural \nlanguage Q&A over PDFs and images using semantic search and retrieval workflows.  \n• Extended multimodal capabilities by integrating license plate recognition, OCR text extraction, \nand analog/digital clock detection to unify computer vision with chat-based UX.  \n• Built a Visa demand forecasting pipeline (ARIMA/SARIMA/Prophet/LSTM) incorporating \nmacroeconomic signals (e.g., unemployment, changes in tech job demands) to improve \nissuance trend prediction.  \n• Automated ingestion of web-scraped PDFs and metadata into Elasticsearch-backed search; optimized Vega \n\ndashboards and anomaly ranking via relevance/frequency scoring experiments.  \n\nTechnical Founder / Lead Software Engineer — Solverah (Open Source) 2025–Present  \n\n• Building a job-matching and career-profiling platform using React + TypeScript + HTML frontend and Flask + \nPython APIs, with a focus on vertical AI agents for personalized recommendations.  \n\n• Implemented structured profile and resume intake workflows and backend services to support scalable \nsimilarity scoring and future model training on user/job representations. \n• Designed deployment-ready architecture with cloud storage integration for uploaded resumes   \n\nand artifacts, emphasizing reliability and low-latency user experiences.  \n\nMachine Learning Engineer — FireNet (Academic Project) 2025  \n\n• Implemented a U-Net-based segmentation model to predict next-day wildfire spread from geospatial inputs; \ndeveloped training/inference code and evaluation workflows.  \n• Engineered dataset preprocessing and experiment tracking to benchmark model performance and \n\niterate on architecture and loss configurations.  \n\nRelevant Skills  \nFull-Stack: React, TypeScript, HTML/CSS, Flask, Python, REST APIs  \nAI/ML: Conversational AI, semantic search, OCR, object detection, time-series \nforecasting (ARIMA/SARIMA/Prophet/LSTM), U-Net segmentation  \nData: Web scraping, NiFi pipelines, Elasticsearch, dashboarding (Vega)  \nSecurity: Modern Binary Exploitation (ROP, reverse engineering, mitigations), network security fundamentals \nLanguages: Python, C++, C, JavaScript, Assembly  \nEducation  \n\nRensselaer Polytechnic Institute (RPI), Troy, NY B.S. Computer Science  \nExpected May 2026 | GPA 3.2  \n\n• Concentration: Systems & Software | Minor: Economics  \n• Scholarships: Rensselaer Recognition Scholarship; Rensselaer Leadership Scholarship  \n• Activities: NCAA Soccer; Pi Kappa Alpha Fraternity (Recruitment Officer)  \n\nAdditional  \nISC2 Certified in Cybersecurity (CC) | Top 500 National Cyber League | Open-source contributor (Easy \nArtistry, CareerMatch AI) \n\n \n \n\f", "extracted_at": "2026-01-28T22:56:31.128090+00:00"}
