{"id": 9997, "resume_key": "9997.pdf", "resume_mime": null, "state": "CA", "created_at": null, "parser": "pdfminer", "error": null, "text": "JANE M. SMITH, RN, BSN\n\nRegistered Nurse | Clinical Care | Patient Advocacy\nEmail: jane.smith@example.com\nPhone: (555) 987-6543\nLocation: Chicago, IL, USA\nLinkedIn: https://www.linkedin.com/in/janesmith-rn\n\nPROFESSIONAL SUMMARY\n\nCompassionate Registered Nurse with 7+ years of experience providing high-quality patient care in\nacute care and outpatient clinical settings. Proven ability to collaborate with multidisciplinary healthcare\nteams, manage complex patient cases, and ensure compliance with healthcare regulations and patient\nsafety standards.\n\nCLINICAL SKILLS\n\nPatient Care: Patient Assessment, Care Planning, Vital Signs Monitoring, Medication Administration\nClinical Procedures: IV Therapy, Wound Care, Catheterization, Infection Control\nHealthcare Systems: Electronic Health Records (Epic, Cerner), Clinical Documentation\nCompliance & Safety: HIPAA Compliance, Patient Privacy, Risk Management\n\nPROFESSIONAL EXPERIENCE\n\nREGISTERED NURSE\nMercy General Hospital — Chicago, IL\nMarch 2019 – Present\n- Provide direct patient care for medical-surgical and post-operative patients\n- Administer medications and monitor patient responses to treatment\n- Coordinate care with physicians, specialists, and allied health professionals\n- Maintain accurate clinical documentation within EHR systems\nCLINICAL NURSE\nLakeside Family Health Clinic — Evanston, IL\nJune 2016 – February 2019\n- Assisted physicians during examinations and minor procedures\n- Educated patients on treatment plans, medications, and preventative care\n- Managed appointment scheduling and follow-up care coordination\n\nEDUCATION\n\nBACHELOR OF SCIENCE IN NURSING (BSN)\nUniversity of Illinois at Chicago — Chicago, IL\nGraduated: May 2016\n\nLICENSURE & CERTIFICATIONS\n\nRegistered Nurse (RN) — State of Illinois\nBasic Life Support (BLS) Certification\nAdvanced Cardiac Life Support (ACLS) Certification\n\n\fVOLUNTEER EXPERIENCE\n\nCOMMUNITY HEALTH VOLUNTEER\nChicago Free Health Clinic\n- Provided basic health screenings and patient education services\n\nADDITIONAL INFORMATION\n\nWork Authorization: Authorized to work in the United States\nLanguages: English (Native), Polish (Conversational)\nProfessional Interests: Patient Advocacy, Community Health, Healthcare Quality Improvement\n\n\f", "extracted_at": "2026-01-12T23:38:55.550729+00:00"}
