{"id": 9995, "resume_key": 9995, "resume_mime": null, "state": " MD", "created_at": null, "parser": "pdfminer", "error": null, "text": "Sebastian Grammas  \nsgrammas10@gmail.com | 410-212-0874  \n\nRelevant Experience  \nSoftware Engineer Intern — ALQIMI Technology Solutions (Rockville, MD) May–Aug 2024, 2025 \n• Delivered production-ready conversational AI features adopted for client-facing use, converting static \ndocuments and images into interactive, searchable insights.  \n• Designed and shipped ALQIMI Assistant, a document-centric chat platform enabling natural \nlanguage Q&A over PDFs and images using semantic search and retrieval workflows.  \n• Extended multimodal capabilities by integrating license plate recognition, OCR text extraction, \nand analog/digital clock detection to unify computer vision with chat-based UX.  \n• Built a Visa demand forecasting pipeline (ARIMA/SARIMA/Prophet/LSTM) incorporating \nmacroeconomic signals (e.g., unemployment, changes in tech job demands) to improve \nissuance trend prediction.  \n• Automated ingestion of web-scraped PDFs and metadata into Elasticsearch-backed search; optimized Vega \n\ndashboards and anomaly ranking via relevance/frequency scoring experiments.  \n\nTechnical Founder / Lead Software Engineer — Solverah (Open Source) 2025–Present  \n\n• Building a job-matching and career-profiling platform using React + TypeScript + HTML frontend and Flask + \nPython APIs, with a focus on vertical AI agents for personalized recommendations.  \n\n• Implemented structured profile and resume intake workflows and backend services to support scalable \nsimilarity scoring and future model training on user/job representations. \n• Designed deployment-ready architecture with cloud storage integration for uploaded resumes   \n\nand artifacts, emphasizing reliability and low-latency user experiences.  \n\nMachine Learning Engineer — FireNet (Academic Project) 2025  \n\n• Implemented a U-Net-based segmentation model to predict next-day wildfire spread from geospatial inputs; \ndeveloped training/inference code and evaluation workflows.  \n• Engineered dataset preprocessing and experiment tracking to benchmark model performance and \n\niterate on architecture and loss configurations.  \n\nRelevant Skills  \nFull-Stack: React, TypeScript, HTML/CSS, Flask, Python, REST APIs  \nAI/ML: Conversational AI, semantic search, OCR, object detection, time-series \nforecasting (ARIMA/SARIMA/Prophet/LSTM), U-Net segmentation  \nData: Web scraping, NiFi pipelines, Elasticsearch, dashboarding (Vega)  \nSecurity: Modern Binary Exploitation (ROP, reverse engineering, mitigations), network security fundamentals \nLanguages: Python, C++, C, JavaScript, Assembly  \nEducation  \n\nRensselaer Polytechnic Institute (RPI), Troy, NY B.S. Computer Science  \nExpected May 2026 | GPA 3.2  \n\n• Concentration: Systems & Software | Minor: Economics  \n• Scholarships: Rensselaer Recognition Scholarship; Rensselaer Leadership Scholarship  \n• Activities: NCAA Soccer; Pi Kappa Alpha Fraternity (Recruitment Officer)  \n\nAdditional  \nISC2 Certified in Cybersecurity (CC) | Top 500 National Cyber League | Open-source contributor (Easy \nArtistry, CareerMatch AI) \n\n \n \n\f", "extracted_at": "2026-02-05T22:57:21.876476+00:00"}
{"id": 9996, "resume_key": 9996, "resume_mime": null, "state": " NY", "created_at": null, "parser": "pdfminer", "error": null, "text": "MICHAEL R. TURNER | CPCU, ARM\nClaims (cid:127) Risk (cid:127) Compliance | michael.turner@email.com | 555-321-7788 | Hartford, CT\n\nBackground: Insurance professional with experience spanning claims adjustment, underwriting support, and\nregulatory compliance. Known for cross-functional coordination, loss analysis, and policy interpretation.\n\nCore Competencies — Claims Investigation; Policy Interpretation; Loss Mitigation; Regulatory Reporting;\nCustomer Escalations; Risk Analysis; Documentation Review\n\nWork History\n\nSenior Claims Analyst (2018–Present)\nNortheast Mutual Insurance Group, Hartford CT\n\n- Lead complex commercial property and casualty claims exceeding $500K\n- Interpret policy language to determine coverage and exclusions\n- Coordinate with legal counsel, adjusters, and external investigators\n\nClaims Adjuster | 2014–2018\nPioneer Assurance Co.\n\n- Conducted on-site and desk claim investigations\n- Prepared loss summaries and settlement recommendations\n- Maintained compliance with state insurance regulations\n\nEducation & Training\n\nB.A. Economics — Central Connecticut State University (2013)\nContinuing Education: Insurance Law Updates, Fraud Detection Workshops\n\nCredentials: Chartered Property Casualty Underwriter (CPCU); Associate in Risk Management (ARM); State of\nConnecticut Licensed Claims Adjuster\n\nSystems exposure includes Guidewire ClaimCenter, Duck Creek, ISO ClaimSearch, Microsoft Excel (loss\nmodeling), internal policy management platforms.\n\nOther Notes\n\nEligible to work in the U.S. without sponsorship. Available for hybrid or remote roles. Professional interests include\ninsurance technology modernization and claims automation.\n\n\f", "extracted_at": "2026-02-05T22:57:21.899186+00:00"}
{"id": 9997, "resume_key": 9997, "resume_mime": null, "state": " CA", "created_at": null, "parser": "pdfminer", "error": null, "text": "JANE M. SMITH, RN, BSN\n\nRegistered Nurse | Clinical Care | Patient Advocacy\nEmail: jane.smith@example.com\nPhone: (555) 987-6543\nLocation: Chicago, IL, USA\nLinkedIn: https://www.linkedin.com/in/janesmith-rn\n\nPROFESSIONAL SUMMARY\n\nCompassionate Registered Nurse with 7+ years of experience providing high-quality patient care in\nacute care and outpatient clinical settings. Proven ability to collaborate with multidisciplinary healthcare\nteams, manage complex patient cases, and ensure compliance with healthcare regulations and patient\nsafety standards.\n\nCLINICAL SKILLS\n\nPatient Care: Patient Assessment, Care Planning, Vital Signs Monitoring, Medication Administration\nClinical Procedures: IV Therapy, Wound Care, Catheterization, Infection Control\nHealthcare Systems: Electronic Health Records (Epic, Cerner), Clinical Documentation\nCompliance & Safety: HIPAA Compliance, Patient Privacy, Risk Management\n\nPROFESSIONAL EXPERIENCE\n\nREGISTERED NURSE\nMercy General Hospital — Chicago, IL\nMarch 2019 – Present\n- Provide direct patient care for medical-surgical and post-operative patients\n- Administer medications and monitor patient responses to treatment\n- Coordinate care with physicians, specialists, and allied health professionals\n- Maintain accurate clinical documentation within EHR systems\nCLINICAL NURSE\nLakeside Family Health Clinic — Evanston, IL\nJune 2016 – February 2019\n- Assisted physicians during examinations and minor procedures\n- Educated patients on treatment plans, medications, and preventative care\n- Managed appointment scheduling and follow-up care coordination\n\nEDUCATION\n\nBACHELOR OF SCIENCE IN NURSING (BSN)\nUniversity of Illinois at Chicago — Chicago, IL\nGraduated: May 2016\n\nLICENSURE & CERTIFICATIONS\n\nRegistered Nurse (RN) — State of Illinois\nBasic Life Support (BLS) Certification\nAdvanced Cardiac Life Support (ACLS) Certification\n\n\fVOLUNTEER EXPERIENCE\n\nCOMMUNITY HEALTH VOLUNTEER\nChicago Free Health Clinic\n- Provided basic health screenings and patient education services\n\nADDITIONAL INFORMATION\n\nWork Authorization: Authorized to work in the United States\nLanguages: English (Native), Polish (Conversational)\nProfessional Interests: Patient Advocacy, Community Health, Healthcare Quality Improvement\n\n\f", "extracted_at": "2026-02-05T22:57:21.930944+00:00"}
{"id": 9998, "resume_key": 9998, "resume_mime": null, "state": " TX", "created_at": null, "parser": "pdfminer", "error": null, "text": "JOHN A. DOE\n\nSoftware Engineer | Machine Learning | Data Systems\n\nEmail: john.doe@example.com\nPhone: (555) 123-4567\nLocation: Boston, MA, USA\nLinkedIn: https://www.linkedin.com/in/johndoe\nGitHub: https://github.com/johndoe\n\nPROFESSIONAL SUMMARY\n\nResults-driven Software Engineer with 5+ years of experience building scalable backend systems,\nmachine learning pipelines, and data-driven applications. Strong background in Python, distributed\nsystems, and applied NLP. Experienced working in cross-functional teams and delivering\nproduction-ready solutions.\n\nTECHNICAL SKILLS\n\nProgramming Languages: Python, Java, C++, JavaScript, SQL\n\nFrameworks & Libraries: Flask, FastAPI, React, TensorFlow, PyTorch, scikit-learn\n\nData & ML: Natural Language Processing (NLP), Feature Engineering, Model Evaluation, ETL\nPipelines\n\nDatabases: PostgreSQL, MySQL, MongoDB, Redis\n\nCloud & DevOps: AWS (EC2, S3, Lambda), Docker, GitHub Actions, Linux\n\nPROFESSIONAL EXPERIENCE\n\nSOFTWARE ENGINEER\nAcme Technologies Inc. — New York, NY\nJune 2021 – Present\n\n- Designed and implemented REST APIs using Flask and FastAPI serving over 1M requests/day\n- Built NLP pipelines to extract structured data from unstructured documents (resumes, PDFs)\n- Improved system performance by 35% through query optimization and caching strategies\n- Collaborated with product managers and designers in an Agile environment\n\nJUNIOR SOFTWARE ENGINEER\nBeta Analytics LLC — Remote\nJuly 2019 – May 2021\n\n- Developed data ingestion pipelines for analytics dashboards\n- Assisted in training and evaluating machine learning models for classification tasks\n- Wrote unit and integration tests to improve code reliability\n- Participated in code reviews and sprint planning\n\nEDUCATION\n\n\fBACHELOR OF SCIENCE IN COMPUTER SCIENCE\nUniversity of Example — Example City, State\nGraduated: May 2019\n\nRelevant Coursework: Data Structures, Algorithms, Databases, Machine Learning, Operating Systems\n\nPROJECTS\n\nRESUME PARSING ENGINE\nBuilt a resume parsing tool to extract skills, experience, and education using spaCy and custom\nrule-based heuristics. Achieved 92% accuracy on labeled test resumes.\n\nRECOMMENDATION SYSTEM\nImplemented collaborative filtering and content-based recommendation models and deployed models\nusing Docker and AWS.\n\nCERTIFICATIONS\n\nAWS Certified Solutions Architect – Associate\nGoogle Data Analytics Certificate\n\nPUBLICATIONS\n\nDoe, J. (2022). Automated Information Extraction from Unstructured Resumes. Journal of Applied\nMachine Learning\n\nVOLUNTEER EXPERIENCE\n\nTECHNICAL MENTOR\nCode for Good Initiative\nMentored junior developers in Python and web development fundamentals\n\nADDITIONAL INFORMATION\n\nWork Authorization: Authorized to work in the United States\nLanguages: English (Native), Spanish (Conversational)\nInterests: Machine Learning, Open-Source Software, Technical Writing\n\n\f", "extracted_at": "2026-02-05T22:57:21.970533+00:00"}
{"id": 9994, "resume_key": 9994, "resume_mime": null, "state": " CA", "created_at": null, "parser": "pypdf", "error": null, "text": "LW LauraWusthoff\nSan Diego, CA 92115(973) 563-0591\nlaura.wusthoff@gmail.com\nPROFESSIONAL\nSUMMARY\nSeasoned Media professional with comprehensive performance media\nexperience. Collaborative and analytical with a data-focused mindset. Skilled at\nbudget management and platform testing, always with a finger on the pulse of\nemerging trends and technologies.\nSKILLS Omni-Channel Media Strategy\nProfitability Analysis\nKPI Creation\nPerformance Testing and\nOptimization\nData Analysis\nPaid Media Platforms\nWORK HISTORY 08/2020 to CURRENTSR. DIRECTOR OF MEDIA\n85SIXTY | San Diego, CA\nDevelop cross-channel marketing strategy and for priority clients that drive\nengagement, conversion and retention with continuous refinement for\nincreased performance\nAssist clients with pivoting business plans to offset Covid impacts and\ncapitalize on emerging opportunities\nCreate KPI frameworks for clients that allow for performance gains,\nsupporting current and long term growth plans\nEnsure that brands are meeting performance forecasts, utilizing platform\nand site data to optimize media strategy\n02/2019 to 08/2020MEDIA DIRECTOR\nBVA | San Diego, CA\nOversaw Paid Search, Paid Social, Display, and Affiliate teams with over\n$2.5MM in monthly spend\nCreated go-to-market strategies for net new brands while forecasting initial\nand long term returns for LTV, CAC, CPA and ROAS\nOwned strategy for largest clients and KPI driven results for entire Media\nportfolio\nStreamlined cross-functional operations processes and workflow to\nincrease efficiency, performance and department profitability\n03/2018 to 02/2019DIRECTOR OF CLIENT STRATEGY\nKatana (Acquired By BVA) | San Diego, CA\nClient service lead for CPG and eCommerce clients leading\ncommunication, contract negotiations, and executive expectations\nEstablished profitability in client portfolio by balancing employee hours and\nclient fees\n05/2016 to 03/2018ASSOCIATE MEDIA DIRECTOR\nKatana (Acquired By BVA) | San Diego, CA\nTroubleshot problem accounts, developed strategic media proposals and\npitched new business for Katana\nMaintained positive revenue growth and client retention within Media\ndepartment by overseeing daily workflow and quality of deliverables for\nseven person department\n04/2015 to 05/2016MEDIA SUPERVISOR\nKatana (Acquired By BVA) | San Diego, CA\nBuilt, executed and optimized media campaigns across programmatic\ndisplay, paid search and paid social platforms\nNormalized and aggregated large data sets to dissect key insights for\noptimization and strategy\n07/2012 to 04/2015SR. PAID MEDIA STRATEGIST\nIMI | San Diego, CA\nPlanned, bought and managed direct response media campaigns for\nagency's largest display accounts\nResearched new media partners and products to stay ahead of digital\ntrends\n08/2010 to 07/2012MEDIA MANAGER\nGreenhaus | San Diego, CA\nPlanned, optimized and negotiated combined traditional and online media\nbudgets including paid search and display media\n09/2008 to 04/2010DIGITAL MARKETING MANAGER\nThe Magna Group | Fair Lawn, NJ\nCreated and grew digital (Paid Search and Google Display) department for\ntraditional media agency\n01/2006 to 09/2008MEDIA BUYER\nThe Magna Group | Fair Lawn, NJ\nRan traditional media campaigns across TV, cable and radio by negotiating\nrates and building vendor relationships\nEDUCATION 06/2005Associate of Arts | Journalism And Media Studies\nRutgers, The State University of New Jersey, New Brunswick, NJ", "extracted_at": "2026-02-05T22:57:22.064792+00:00"}
