{"id": 9995, "resume_key": 9995, "resume_mime": null, "state": " MD", "created_at": null, "parser": "pymupdf", "error": null, "text": "Sebastian Grammas  \nsgrammas10@gmail.com | 410-212-0874  \nRelevant Experience  \nSoftware Engineer Intern — ALQIMI Technology Solutions (Rockville, MD) May–Aug 2024, 2025 \n• Delivered production-ready conversational AI features adopted for client-facing use, converting static \ndocuments and images into interactive, searchable insights.  \n• Designed and shipped ALQIMI Assistant, a document-centric chat platform enabling natural \nlanguage Q&A over PDFs and images using semantic search and retrieval workflows.  \n• Extended multimodal capabilities by integrating license plate recognition, OCR text extraction, \nand analog/digital clock detection to unify computer vision with chat-based UX.  \n• Built a Visa demand forecasting pipeline (ARIMA/SARIMA/Prophet/LSTM) incorporating \nmacroeconomic signals (e.g., unemployment, changes in tech job demands) to improve \nissuance trend prediction.  \n• Automated ingestion of web-scraped PDFs and metadata into Elasticsearch-backed search; optimized Vega \ndashboards and anomaly ranking via relevance/frequency scoring experiments.  \nTechnical Founder / Lead Software Engineer — Solverah (Open Source) 2025–Present  \n• Building a job-matching and career-profiling platform using React + TypeScript + HTML frontend and Flask + \nPython APIs, with a focus on vertical AI agents for personalized recommendations.  \n• Implemented structured profile and resume intake workflows and backend services to support scalable \nsimilarity scoring and future model training on user/job representations. \n• Designed deployment-ready architecture with cloud storage integration for uploaded resumes   \nand artifacts, emphasizing reliability and low-latency user experiences.  \nMachine Learning Engineer — FireNet (Academic Project) 2025  \n• Implemented a U-Net-based segmentation model to predict next-day wildfire spread from geospatial inputs; \ndeveloped training/inference code and evaluation workflows.  \n• Engineered dataset preprocessing and experiment tracking to benchmark model performance and \niterate on architecture and loss configurations.  \nRelevant Skills  \nFull-Stack: React, TypeScript, HTML/CSS, Flask, Python, REST APIs  \nAI/ML: Conversational AI, semantic search, OCR, object detection, time-series \nforecasting (ARIMA/SARIMA/Prophet/LSTM), U-Net segmentation  \nData: Web scraping, NiFi pipelines, Elasticsearch, dashboarding (Vega)  \nSecurity: Modern Binary Exploitation (ROP, reverse engineering, mitigations), network security fundamentals \nLanguages: Python, C++, C, JavaScript, Assembly  \nEducation  \nRensselaer Polytechnic Institute (RPI), Troy, NY B.S. Computer Science  \nExpected May 2026 | GPA 3.2  \n• Concentration: Systems & Software | Minor: Economics  \n• Scholarships: Rensselaer Recognition Scholarship; Rensselaer Leadership Scholarship  \n• Activities: NCAA Soccer; Pi Kappa Alpha Fraternity (Recruitment Officer)  \nAdditional  \nISC2 Certified in Cybersecurity (CC) | Top 500 National Cyber League | Open-source contributor (Easy \nArtistry, CareerMatch AI)", "extracted_at": "2026-02-09T20:45:41.492671+00:00"}
{"id": 9996, "resume_key": 9996, "resume_mime": null, "state": " NY", "created_at": null, "parser": "pymupdf", "error": null, "text": "MICHAEL R. TURNER | CPCU, ARM\nClaims • Risk • Compliance | michael.turner@email.com | 555-321-7788 | Hartford, CT\nBackground: Insurance professional with experience spanning claims adjustment, underwriting support, and\nregulatory compliance. Known for cross-functional coordination, loss analysis, and policy interpretation.\nCore Competencies — Claims Investigation; Policy Interpretation; Loss Mitigation; Regulatory Reporting;\nCustomer Escalations; Risk Analysis; Documentation Review\nWork History\nSenior Claims Analyst (2018–Present)\nNortheast Mutual Insurance Group, Hartford CT\n- Lead complex commercial property and casualty claims exceeding $500K\n- Interpret policy language to determine coverage and exclusions\n- Coordinate with legal counsel, adjusters, and external investigators\nClaims Adjuster | 2014–2018\nPioneer Assurance Co.\n- Conducted on-site and desk claim investigations\n- Prepared loss summaries and settlement recommendations\n- Maintained compliance with state insurance regulations\nEducation & Training\nB.A. Economics — Central Connecticut State University (2013)\nContinuing Education: Insurance Law Updates, Fraud Detection Workshops\nCredentials: Chartered Property Casualty Underwriter (CPCU); Associate in Risk Management (ARM); State of\nConnecticut Licensed Claims Adjuster\nSystems exposure includes Guidewire ClaimCenter, Duck Creek, ISO ClaimSearch, Microsoft Excel (loss\nmodeling), internal policy management platforms.\nOther Notes\nEligible to work in the U.S. without sponsorship. Available for hybrid or remote roles. Professional interests include\ninsurance technology modernization and claims automation.", "extracted_at": "2026-02-09T20:45:41.515246+00:00"}
{"id": 9997, "resume_key": 9997, "resume_mime": null, "state": " CA", "created_at": null, "parser": "pymupdf", "error": null, "text": "JANE M. SMITH, RN, BSN\nRegistered Nurse | Clinical Care | Patient Advocacy\nEmail: jane.smith@example.com\nPhone: (555) 987-6543\nLocation: Chicago, IL, USA\nLinkedIn: https://www.linkedin.com/in/janesmith-rn\nPROFESSIONAL SUMMARY\nCompassionate Registered Nurse with 7+ years of experience providing high-quality patient care in\nacute care and outpatient clinical settings. Proven ability to collaborate with multidisciplinary healthcare\nteams, manage complex patient cases, and ensure compliance with healthcare regulations and patient\nsafety standards.\nCLINICAL SKILLS\nPatient Care: Patient Assessment, Care Planning, Vital Signs Monitoring, Medication Administration\nClinical Procedures: IV Therapy, Wound Care, Catheterization, Infection Control\nHealthcare Systems: Electronic Health Records (Epic, Cerner), Clinical Documentation\nCompliance & Safety: HIPAA Compliance, Patient Privacy, Risk Management\nPROFESSIONAL EXPERIENCE\nREGISTERED NURSE\nMercy General Hospital — Chicago, IL\nMarch 2019 – Present\n- Provide direct patient care for medical-surgical and post-operative patients\n- Administer medications and monitor patient responses to treatment\n- Coordinate care with physicians, specialists, and allied health professionals\n- Maintain accurate clinical documentation within EHR systems\nCLINICAL NURSE\nLakeside Family Health Clinic — Evanston, IL\nJune 2016 – February 2019\n- Assisted physicians during examinations and minor procedures\n- Educated patients on treatment plans, medications, and preventative care\n- Managed appointment scheduling and follow-up care coordination\nEDUCATION\nBACHELOR OF SCIENCE IN NURSING (BSN)\nUniversity of Illinois at Chicago — Chicago, IL\nGraduated: May 2016\nLICENSURE & CERTIFICATIONS\nRegistered Nurse (RN) — State of Illinois\nBasic Life Support (BLS) Certification\nAdvanced Cardiac Life Support (ACLS) Certification\n\nVOLUNTEER EXPERIENCE\nCOMMUNITY HEALTH VOLUNTEER\nChicago Free Health Clinic\n- Provided basic health screenings and patient education services\nADDITIONAL INFORMATION\nWork Authorization: Authorized to work in the United States\nLanguages: English (Native), Polish (Conversational)\nProfessional Interests: Patient Advocacy, Community Health, Healthcare Quality Improvement", "extracted_at": "2026-02-09T20:45:41.529389+00:00"}
{"id": 9998, "resume_key": 9998, "resume_mime": null, "state": " TX", "created_at": null, "parser": "pymupdf", "error": null, "text": "JOHN A. DOE\nSoftware Engineer | Machine Learning | Data Systems\nEmail: john.doe@example.com\nPhone: (555) 123-4567\nLocation: Boston, MA, USA\nLinkedIn: https://www.linkedin.com/in/johndoe\nGitHub: https://github.com/johndoe\nPROFESSIONAL SUMMARY\nResults-driven Software Engineer with 5+ years of experience building scalable backend systems,\nmachine learning pipelines, and data-driven applications. Strong background in Python, distributed\nsystems, and applied NLP. Experienced working in cross-functional teams and delivering\nproduction-ready solutions.\nTECHNICAL SKILLS\nProgramming Languages: Python, Java, C++, JavaScript, SQL\nFrameworks & Libraries: Flask, FastAPI, React, TensorFlow, PyTorch, scikit-learn\nData & ML: Natural Language Processing (NLP), Feature Engineering, Model Evaluation, ETL\nPipelines\nDatabases: PostgreSQL, MySQL, MongoDB, Redis\nCloud & DevOps: AWS (EC2, S3, Lambda), Docker, GitHub Actions, Linux\nPROFESSIONAL EXPERIENCE\nSOFTWARE ENGINEER\nAcme Technologies Inc. — New York, NY\nJune 2021 – Present\n- Designed and implemented REST APIs using Flask and FastAPI serving over 1M requests/day\n- Built NLP pipelines to extract structured data from unstructured documents (resumes, PDFs)\n- Improved system performance by 35% through query optimization and caching strategies\n- Collaborated with product managers and designers in an Agile environment\nJUNIOR SOFTWARE ENGINEER\nBeta Analytics LLC — Remote\nJuly 2019 – May 2021\n- Developed data ingestion pipelines for analytics dashboards\n- Assisted in training and evaluating machine learning models for classification tasks\n- Wrote unit and integration tests to improve code reliability\n- Participated in code reviews and sprint planning\nEDUCATION\n\nBACHELOR OF SCIENCE IN COMPUTER SCIENCE\nUniversity of Example — Example City, State\nGraduated: May 2019\nRelevant Coursework: Data Structures, Algorithms, Databases, Machine Learning, Operating Systems\nPROJECTS\nRESUME PARSING ENGINE\nBuilt a resume parsing tool to extract skills, experience, and education using spaCy and custom\nrule-based heuristics. Achieved 92% accuracy on labeled test resumes.\nRECOMMENDATION SYSTEM\nImplemented collaborative filtering and content-based recommendation models and deployed models\nusing Docker and AWS.\nCERTIFICATIONS\nAWS Certified Solutions Architect – Associate\nGoogle Data Analytics Certificate\nPUBLICATIONS\nDoe, J. (2022). Automated Information Extraction from Unstructured Resumes. Journal of Applied\nMachine Learning\nVOLUNTEER EXPERIENCE\nTECHNICAL MENTOR\nCode for Good Initiative\nMentored junior developers in Python and web development fundamentals\nADDITIONAL INFORMATION\nWork Authorization: Authorized to work in the United States\nLanguages: English (Native), Spanish (Conversational)\nInterests: Machine Learning, Open-Source Software, Technical Writing", "extracted_at": "2026-02-09T20:45:41.535716+00:00"}
{"id": 9994, "resume_key": 9994, "resume_mime": null, "state": " CA", "created_at": null, "parser": "pymupdf", "error": null, "text": "LW\nLaura Wusthoff\nSan Diego, CA 92115\n(973) 563-0591\nlaura.wusthoff@gmail.com\nPROFESSIONAL\nSUMMARY\nSeasoned Media professional with comprehensive performance media\nexperience. Collaborative and analytical with a data-focused mindset. Skilled at\nbudget management and platform testing, always with a finger on the pulse of\nemerging trends and technologies.\nSKILLS\nOmni-Channel Media Strategy\nProfitability Analysis\nKPI Creation\nPerformance Testing and\nOptimization\nData Analysis\nPaid Media Platforms\nWORK HISTORY\n08/2020 to CURRENT\nSR. DIRECTOR OF MEDIA\n85SIXTY | San Diego, CA\nDevelop cross-channel marketing strategy and for priority clients that drive\nengagement, conversion and retention with continuous refinement for\nincreased performance\nAssist clients with pivoting business plans to offset Covid impacts and\ncapitalize on emerging opportunities\nCreate KPI frameworks for clients that allow for performance gains,\nsupporting current and long term growth plans\nEnsure that brands are meeting performance forecasts, utilizing platform\nand site data to optimize media strategy\n02/2019 to 08/2020\nMEDIA DIRECTOR\nBVA | San Diego, CA\nOversaw Paid Search, Paid Social, Display, and Affiliate teams with over\n$2.5MM in monthly spend\nCreated go-to-market strategies for net new brands while forecasting initial\nand long term returns for LTV, CAC, CPA and ROAS\nOwned strategy for largest clients and KPI driven results for entire Media\nportfolio\nStreamlined cross-functional operations processes and workflow to\nincrease efficiency, performance and department profitability\n03/2018 to 02/2019\nDIRECTOR OF CLIENT STRATEGY\nKatana (Acquired By BVA) | San Diego, CA\nClient service lead for CPG and eCommerce clients leading\n\ncommunication, contract negotiations, and executive expectations\nEstablished profitability in client portfolio by balancing employee hours and\nclient fees\n05/2016 to 03/2018\nASSOCIATE MEDIA DIRECTOR\nKatana (Acquired By BVA) | San Diego, CA\nTroubleshot problem accounts, developed strategic media proposals and\npitched new business for Katana\nMaintained positive revenue growth and client retention within Media\ndepartment by overseeing daily workflow and quality of deliverables for\nseven person department\n04/2015 to 05/2016\nMEDIA SUPERVISOR\nKatana (Acquired By BVA) | San Diego, CA\nBuilt, executed and optimized media campaigns across programmatic\ndisplay, paid search and paid social platforms\nNormalized and aggregated large data sets to dissect key insights for\noptimization and strategy\n07/2012 to 04/2015\nSR. PAID MEDIA STRATEGIST\nIMI | San Diego, CA\nPlanned, bought and managed direct response media campaigns for\nagency's largest display accounts\nResearched new media partners and products to stay ahead of digital\ntrends\n08/2010 to 07/2012\nMEDIA MANAGER\nGreenhaus | San Diego, CA\nPlanned, optimized and negotiated combined traditional and online media\nbudgets including paid search and display media\n09/2008 to 04/2010\nDIGITAL MARKETING MANAGER\nThe Magna Group | Fair Lawn, NJ\nCreated and grew digital (Paid Search and Google Display) department for\ntraditional media agency\n01/2006 to 09/2008\nMEDIA BUYER\nThe Magna Group | Fair Lawn, NJ\nRan traditional media campaigns across TV, cable and radio by negotiating\nrates and building vendor relationships\nEDUCATION\n06/2005\nAssociate of Arts | Journalism And Media Studies\nRutgers, The State University of New Jersey, New Brunswick, NJ", "extracted_at": "2026-02-09T20:45:41.552723+00:00"}
{"id": 9993, "resume_key": 9993, "resume_mime": null, "state": " CO", "created_at": null, "parser": "pymupdf", "error": null, "text": "Anne Taylor Murlowski\n13768 Josephine Ct. ●Thornton CO 80602 ●(720)296-3302 ●annemurlowski@gmail.com\nEducation\nColorado State University, Fort Collins, CO Majors: Technical Journalism & Liberal Arts\nSkills Summary\nExperienced in developing innovative marketing campaigns utilizing search engine optimization, paid media,  marketing\nautomation, social media, email marketing and blogger outreach. Confident facilitator and corporate trainer.\nWell-versed in the use of: Agile Marketing, Account Based Marketing, Affiliate Marketing, Pardot, Marketo, Salesforce,\nSEMRush, Drift, Social Studio, Adobe Photoshop, Cision, Hootsuite, and Google Analytics.\nProfessional Experience\nSENIOR MANAGER, DIGITAL MARKETING\nSEPTEMBER 2020 - CURRENT\nConga\nBroomfield, CO\n●\nManaged paid media spend of $4M+ across SEM, Social, Content Syndication and Cost Per Lead Programs.\nAchieved target pipeline goals over consecutive quarters.\n●\nMaintained consistent brand messaging and paid media strategy across two divergent brands while undergoing\nmerger and acquisition processes to transition to a single brand.\n●\nOwned digital strategy including launch of new corporate website across multiple regions and languages.\n●\nCoached five direct reports including developing career paths and working collaboratively to exceed individual\ncontributor goals for the digital strategy team as a whole. Responsible for team hiring including working with\nexternal recruiting agencies to identify best-in-class candidates for open roles.\n●\nActivated global campaign initiatives by building and owning omni-channel digital media plans for corporate\nevents, lead generation and corporate sponsorships.\n●\nResponsible for all vendor relationships including RFP process for paid media programs and agency relationships.\nManaged contracting process working collaboratively with legal and purchasing.\nDIGITAL MARKETING STRATEGIST\nNOVEMBER 2019 - SEPTEMBER 2020\nScaled Agile\nBoulder, CO\n●\nExecuted go to market campaign for the launch of remote training products including refining segmentations and\nimplementing multi-touch communication channels. Increased established audience engagement by 101%.\n●\nDeveloped strategy and launched a comprehensive social listening campaign in collaboration with the Customer\nSuccess team to identify customer support tickets, legal and licensing violations, and sales opportunities.\n●\nCoordinated development of Marketo landing page template and owned landing page build outs.\n●\nImproved digital ad spend by implementing KPI tracking and refining campaign structures to target customer\npersonas and drive sales. Increased class registration using social media advertising.\n●\nSpearheaded channel marketing advertising strategy using influencer marketing tools to positively impact\npartner sales for global training providers, including campaigns in Ireland, India, and Australia.\n●\nChampioned SEO strategy including enabling keyword research and monthly search performance monitoring.\n\nDIRECTOR OF MARKETING\nAUGUST 2016 - NOVEMBER 2019\nMARKETING MANAGER\nAUGUST 2014 - AUGUST 2016\nSuiteHop\nDenver, CO\n●\nEstablished brand identity for a startup company to bring well-received brand voice and style to advertising,\nmedia relations and website messaging. Managed marketing strategy and budget.\n●\nBuilt a marketing team from the ground up, providing creative direction to in-house marketing staff and a team\nof external contractors responsible for producing marketing collateral including print, digital, public relations,\nvideo and SEO.\n●\nCreated CRM infrastructure (SalesForce) to produce marketing reporting dashboards. Calculated marketplace\nKPIs and ROAS. Analyzing sales data to evaluate customer trends and develop customer personas.\n●\nManaged omnichannel lead gen, including implementation of SEO, e-mail, radio, print, display, microsites\ninfluencer marketing, and direct mail. Overall marketing strategy resulted in consistent website traffic increase of\n45% annually and 330% annual increase in ecommerce transactions.\n●\nBuilt content marketing automation process including chatbots to generate marketing qualified leads.\nEstablished lead nurture and retention program. Developed strategies for increasing customer lifetime value and\nlowered acquisition costs using Account Based Marketing.\nSOCIAL MEDIA MANAGER\nMAY 2013 – AUGUST 2014\nShane Company\nDenver, CO\n●\nResponsible for strategy and implementation for the national footprint of Shane Co. social presence including\nFacebook, Twitter, Google+, Pinterest, Instagram, Yelp and other review sites.\n●\nManaged corporate blog team consisting of 21 local store contributors. Managed blog editorial timeline.\n●\nIncreased ROI on digital media spend by analyzing ad performance and optimizing spend.\n●\nExecuted local events plan for building community presence within Yelp Elite network.\n●\nManaged influencer marketing program and secured paid advertorial partnerships.\nCONTENT SPECIALIST\nJULY 2011 – MAY 2013\nA-Train Marketing Communications\nFort Collins, CO\n●\nResponsible for the development of digital marketing strategy, search engine optimization, social media strategy\nand training for all A-Train clientele.\n●\nAssisted with project management by developing project directions and relaying information, including creative\ndirection to design team and copywriters. Created content and tracked production timelines.\n●\nAttended milestone meetings and drove digital account strategy for top clients.\nMARKETING AND COMMUNICATIONS MANAGER\nAUGUST 2010 – JULY 2011\nCOMMUNICATIONS COORDINATOR\nFEBRUARY 2009 – AUGUST 2010\nDelta Delta Delta Fraternity\nArlington, TX\n●\nDeveloped a marketing plan for national campaign ‘Fat Talk Free Week’, an online cause-campaign reaching over\n88,000,000 viewers via TIME online, CNN, MSNBC, Huffington Post and countless blogs.\n●\nCreated content and tracked production timelines while coordinating the publication of e-newsletters for\nnationwide membership and volunteers.\n●\nDeveloped and implemented plans for social media engagement including use of Twitter, Facebook, LinkedIn and\nFlickr. Grew Twitter followers over 3,400 and Facebook over 10,000, in a 1 year period.\n●\nContent managed TriDelta.org and chapter extension websites including formal redesign.", "extracted_at": "2026-02-09T20:45:41.582040+00:00"}
{"id": 9992, "resume_key": 9992, "resume_mime": null, "state": " NA", "created_at": null, "parser": "pymupdf", "error": null, "text": "Sydney Grogg____________________________________________ \n403 Belle Point Dr \n \n \n \n \n \n \n  sgrogg70@gmail.com \n \nMt. Pleasant, 29464 \n \n \n \n \n \n \n \n      843.330.3524 \n \nSeeking to expand my education in the healthcare field where I know I can excel  \nin a professional environment and achieve my goals. \n \nExperience: \n \nCharleston County Schools – Belle Hall Kaleidoscope  \n         3/15-present \nAfter School/Summer Counselor \n \n- Supervise and interact with children \n- Prepare lesson plans \n- Coordinate daily summer activities and field trips  \n \nPlay Garden \n \n \n \n \n \n \n \n                  12/14-3/15 \nTeacher/Facilitator \n \n- Daily supervising and interaction with children of all ages \n- Arranged daily art, music, yoga, etc… activities \n- Managed and processed customers \n \nEducation: \n \nCoastal Christian Prepatory School  \n \n \n \n \n \n8/08-5/13 \n \nUniversity of South Carolina Beaufort \n \n \n \n \n \n8/13-12/14 \n \nCollege of Charleston  \n \n \n \n \n \n \n \n1/15-present \n \nPersonal Achievements:  \n \nMember of the Phi Mu Fraternity \n \nHomecoming Queen of 2013 \n \nVarsity Volleyball  \n \nVarsity Cheerleading  \n \n\nVarsity Basketball  \n \nSkills: \n \nCPR certified \n \nFirst Aid certified", "extracted_at": "2026-02-09T20:45:41.598009+00:00"}
{"id": 9991, "resume_key": 9991, "resume_mime": null, "state": " CO", "created_at": null, "parser": "pymupdf", "error": null, "text": "NATALIE ROSS\nN\nR\nNatRoss14@gmail.com\n314.566.2989\nDenver, CO\n•\nVisible Red Rocks Unpaused: \nAdweek, Shorty's, The Drum, \nDenver50, One Club\n•\nVisible #Phonetopia: \nDenver50, One Club\n•\nVisible 404 Stores: Cannes \nLions shortlist, One Club\n•\nStarbucks K-Cup “Flavor \nMatch”, Pro Award\n•\nSeattle's Best Coﬀee “It’s like a \nfree upgrade”, Silver \nInternationalist Awards \nAWARDS & RECOGNITION \n•\nRelationship building\n•\nFinancial management\n•\nTeam building & leadership\n•\nStrategic brand planning\n•\nComms & creative strategy\n•\nDigital & social innovation\n•\nPaid media & measurement\n•\nCPG & beverage\n•\nShopper & retail marketing\n•\nPromotional & event \nmarketing\n•\nStrong written & verbal \ncommunications\nSKILLS & EXPERTISE\n•\nIn just 90 days restored the health of our largest account and negotiated our FY19 \nretainer which more than doubled revenue. Our relationship still remains strong.\n•\nManaging a total client portfolio of +$20MM and driving ~20% organic growth annually.\n•\nMentor and support in career development for an account team of +5 FTEs.\n•\nLed several innovative and award-winning immersive events including Red Rocks \nUnPaused, Unlimited Massages, #InVisibleNY, SXSW Music Box and #Phonetopia.\nS U M M A R Y\nA passionate and driven business leader with over 15 years of integrated marketing and \nbrand building experience, seeking a management position that allows me to inspire a \nmotivated team and drive growth and innovation for a brand. \nP R O F E S S I O N A L  E X P E R I E N C E\nGroup Account Director     \nMadwell, Denver, CO     \n         June 2018 – Present \nIntegrated Brand & Digital Marketing, Visible Wireless\nResponsible for leading and growing Visible, a newly launched brand and wireless \ncarrier backed by Verizon. \nResponsible for oversight of national CPG campaign initiatives, scope negotiation, revenue \nand staﬃng for Starbucks, Seattle’s Best Coﬀee and TAZO ($8MM annual revenue). \n•\nGrew our retained agency fee by 37% and delivered against 100% of organic revenue \ngoals 4 years in a row (+$250k/year) through proactive selling.\n•\nManaged professional development for 6 direct reports, negotiated annual scoping and \nstaﬃng for 35 FTEs, and ensured ongoing team health and training.\n•\nLed national integrated product launch of Starbucks Hot Cocoa K-Cups campaign \nincluding TV, print, web, DM sampling, digital media and social inﬂuencer activation.\n•\nLed the last ﬁve Starbucks seasonal marketing initiatives, of which Holiday FY’17 was \nhistorically the highest performing program to date, resulting in 97% ACV.\n•\nAccount lead on SBC qualitative consumer research, brand re-positioning, brand site \nredesign and development, social content strategy, e-CRM and inﬂuencer \nprogramming.\nGroup Account Director     \nThe Integer Group   \n         Oct 2014 – June 2018 \nIntegrated CPG Marketing, Starbucks and Seattle’s Best Coﬀee \n•\nPioneered the MillerCoors “Digital Toolbox”–an arsenal of digital programs that were\ntested and standardized for customization across the business.\n•\nLaunched the ﬁrst Food and Beer pairing website for MillerCoors,\nPintsandPlates.com–named MillerCoors program of the year.\n•\nPiloted a motion-activated retail display leading to a 15% lift in oﬀ-premise beer sales.\n•\nLaunched an NFL test campaign for Miller Lite in partnership with Drizly alcohol delivery.\n•\nSuccessfully activated the Miami Heat Fancam social experience–a ﬁrst for MillerCoors.\nDigital Innovations Director        The Integer Group   \nSept 2012 – Oct 2014 \nBRAND PARTNERS\nDelivered integrated program planning, digital media execution, creative development \nand cross-agency integration. In just 2 years, established a digital brand presence that was \nheld up as the “gold standard” at MillerCoors. \n•\nLed the UX, design and launch of the brand’s ﬁrst mobile optimized site.\n•\nLed a fully integrated award-winning program, \"Craft the Next Blue Moon\", to launch a\nnew consumer-generated ﬂavor.\n•\nEstablished the strategic approach and social voice for the brand, growing our Facebook\nfans from 40,000 to 400,000+ in under a year.\nAccount Supervisor    \nThe Integer Group   \n          Jan 2009 – Sept 2012 \nIntegrated Digital Marketing, Blue Moon Brewing Company\nTest and Learn digital/retail Marketing, MillerCoors portfolio \n\nNATALIE ROSS\nN\nR\nNatRoss14@gmail.com\n314.566.2989\nDenver, CO\nA LITTLE ABOUT ME\nI landed in Colorado just 90 \ndays after an amazing \nexperience at the Estes Park \nYoga Conference. I’ll take any \nchance I have to enjoy the \noutdoors; camping, \nhiking, biking, skiing or ﬁshing. \nA 20 year vegetarian, I enjoy \ncooking and experimenting \nwith new recipes (chopping \nvegetables is like meditation \nfor me). Fun fact: I once made \nthe Denver roller derby team.\nP R O F E S S I O N A L  E X P E R I E N C E\n•\nManaged AT&T Small Business Advisory Panels; focus group recruitment, discussion\nguides and research readouts.\n•\nOversaw national print, radio and digital media for AT&T Small Business.\nAccount Supervisor       \n       Rodgers Townsend/DDB \n           April – Dec 2008\n•\nManaged a team of three after just four years of experience, received three promotions \nwithin five years and worked remotely as a Comcast Marketing Brand Manager.\n•\nLed national campaigns for AB InBev, including Bass Ale, Czechvar and Land Shark Lager.\n•\nProduced and hosted on-site event activation of Comcast/Clear Channel sponsorship at \n13 concert venues and 150 events.\n•\nCo-managed national promotions for International Truck & Engine including celebrity tie-\nins, direct mail, dealer POS and interactive sweepstakes and fulﬁllment.\nAccount Manager                    Momentum Worldwide                    July 2003 – April 2008\nBachelor of \nJournalism/Advertising, \nUniversity of Missouri-Columbia, \nSchool of Journalism \nMagna Cum Laude \nEDUCATION", "extracted_at": "2026-02-09T20:45:41.648240+00:00"}
